ehrconnect.json

{
	"photoPathMatch": "(.*)\\\\(.*)\\\\(.*).jpg",
	"photoVars": ["parentphotodir", "NHID", "photoname"],
	"testConnectionQuery": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\n      <ubiNum>10</ubiNum>\n    </NumberToWords>\n  </soap12:Body>\n</soap12:Envelope>",
	"testConnectionShowField": "",
	"createUserQuery": "",	
	"getIdQuery": "",
	"insertAttachmentQuery": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\n      <ubiNum>10</ubiNum>\n    </NumberToWords>\n  </soap12:Body>\n</soap12:Envelope>",
	"host": "localhost",
	"dbname": "C:\\MT32\\data\\MT32.ib",
	"username": "SYSDBA",
	"password": "masterkey",
	"staffname": "#sys",
	"computer": "",
	"localFolderMapDown": "C:\\mt32\\",
	"mapDownTo": "M:\\",
	"location": "M",
	"useResized": false,
	"useOriginal": true,
	"parentPhotoDir": "C:\\MT32\\Attachments",
	"useODBC": true,
	"requestType": "soap",
	"endPoints": {
		"testConnection": "http://www.dataaccess.com/webservicesserver/",
		"getId": "",
		"insertAttachment": "http://www.dataaccess.com/webservicesserver/",
		"includePhotoInPOST": false,
		"ssl": true,
		"sslCertFile": "",
		"timeoutFailureMs": 2000,
		"headers": [ "Content-type: text/xml;charset=\"utf-8\"",
                       "Accept: text/xml",
                        "Cache-Control: no-cache",
                        "Pragma: no-cache",
                        "SOAPAction: [soapEndpoint]", 
                        "Content-length: [contentLength]" ]
	},
	"responseObjects": {
		"testConnection": {
			"success" :	"string",
			"successValue": "ten "	
		},
		"getId": {
			"success" :	"",
			"successValue": "",
			"returnedValue" : "",
			"duplicate" : "",
			"duplicateValue": ""
		},
		"insertAttachment" :{
			"success" :	"string",
			"successValue": "ten "
		}
	},		
	"dsnHere": "medtech32",
	"logging": true,
	"capitaliseNHID": true,
	"dbCurrentTimeQuery": "",
	"constraints": {
		"patientID": 7,
		"photoName": 100,
		"staffname": 4,
		"computer": 15,
		"location": 1,
		"fullphotopath": 255	
	},
	"createUserHelp": "",
	"createUserHelpFull": "",
	"odbcUserHelp": ""
	
	 
}